// Задача *: Напишите программу, которая задаёт массив из 8 элементов случайными числами и выводит их на экран. 
//Также ищет второй максимум (число меньше максимального элемента, но больше всех остальных)
//
Console.WriteLine("Hello, World!");
