#Напишите программу в которой пользователь будет задавать две строки прграмма -
# определять количество вхождений одной строки в другой.
String_1 = (input())
String_2 = (input())
print(String_1.count(String_2))
